In [41]:
from sqlalchemy import create_engine, text
import pandas as pd

In [42]:
engine = create_engine('postgresql+psycopg2://postgres:noi123456@noing-db.c2qkku433l07.ap-southeast-1.rds.amazonaws.com:5432/postgres')

In [43]:
with engine.connect() as conn:
    result = conn.execute(text('select "userId", "movieId", "rating" from ratings'))
    ratings = result.all()

In [44]:
df = pd.DataFrame(ratings, columns = ['userId', 'movieId', 'rating'])

In [60]:
df

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100831     610   166534     4.0
100832     610   168248     5.0
100833     610   168250     5.0
100834     610   168252     5.0
100835     610   170875     3.0

[100836 rows x 3 columns]

In [49]:
user_df = df[['userId']]
user_df = user_df.drop_duplicates(keep='last')
user_df = user_df.sort_values(by=['userId'])
user_df.reset_index(drop=True, level=0, inplace=True)
user_df

     userId
0         1
1         2
2         3
3         4
4         5
..      ...
605     606
606     607
607     608
608     609
609     610

[610 rows x 1 columns]

In [50]:
user_dict = dict(zip(user_df['userId'].values ,list(user_df.index+1)))

In [52]:
movie_df = df[['movieId']]
movie_df = movie_df.drop_duplicates(keep='last')
movie_df = movie_df.sort_values(by=['movieId'])
movie_df.reset_index(drop=True, level=0, inplace=True)
movie_df

      movieId
0           1
1           2
2           3
3           4
4           5
...       ...
9719   193581
9720   193583
9721   193585
9722   193587
9723   193609

[9724 rows x 1 columns]

In [53]:
movie_dict = dict(zip(movie_df['movieId'].values ,list(movie_df.index+1)))

In [57]:
df.apply(lambda x)

0              1
1              3
2              6
3             47
4             50
           ...
100831    166534
100832    168248
100833    168250
100834    168252
100835    170875
Name: movieId, Length: 100836, dtype: int64

In [61]:
df['movieId'] = df['movieId'].map(lambda x: movie_dict[x])
df['userId'] = df['userId'].map(lambda x: user_dict[x])

In [64]:
df

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       44     5.0
4            1       47     5.0
...        ...      ...     ...
100831     610     9417     4.0
100832     610     9444     5.0
100833     610     9445     5.0
100834     610     9446     5.0
100835     610     9486     3.0

[100836 rows x 3 columns]